app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    comments = Comment.all

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
---
  def user_only_index
    comments = current_user.comments.all

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 40], ["LIMIT", 1]]
---
  def update
    comment = current_user.comments.find(params[:id])

INSERT INTO "comments" ("user_id", "post", "created_at", "updated_at", "trail_id", "user_name", "trail_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["post", "Test!!"], ["created_at", "2020-07-07 23:36:14.554501"], ["updated_at", "2020-07-07"], ["trail_id", 7075150], ["user_name", "Jeremy Gabriel"], ["trail_name", "Cobb Trail"]]
---
  def create
    comment = current_user.comments.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
---
  def destroy
    comment = current_user.comments.find(params[:id])
    if comment.destroy