app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post", "created_at", "updated_at", "trail_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post", "This trail was nice."], ["created_at", "2020-07-01 18:07:45.005169"], ["updated_at", "2020-07-01 18:07:45.005169"], ["trail_id", 7022523]]
---
  def create
    comment = current_user.comments.create(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 8]]
---
  def destroy
    comment = current_user.comments.find(params[:id])
    if comment.destroy