app/controllers/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
---
  def index
    favorites = current_user.favorites.all

INSERT INTO "favorites" ("user_id", "fav_trail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["fav_trail_id", 7022523], ["created_at", "2020-06-30 22:42:22.684328"], ["updated_at", "2020-06-30 22:42:22.684328"]]
---
  def create
    favorite = current_user.favorites.create(favorite_params)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 2]]
---
  def destroy
    favorite = current_user.favorites.find(params[:id])
    if favorite.destroy