app/controllers/main_controller.rb

  def index
    if user_signed_in?
      @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]