app/controllers/questionnaires_controller.rb

        def index
            questions = Questionnaire.all
---
SELECT "questionnaires".* FROM "questionnaires"

        def create
            question = current_user.questionnaires.create(questionnaire_params)
---
INSERT INTO "questionnaires" ("user_id", "trail_name", "trail_id", "question19", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["trail_name", "Runyon Canyon"], ["trail_id", 7021529], ["question19", "notavailable"], ["created_at", "2020-07-09 21:10:11.189056"], ["updated_at", "2020-07-09 21:10:11.189056"]]